In [2]:
import pandas as pd
from sqlalchemy import create_engine
from pydataset import data

## 1. Use the pydataset module to load the iris data set into a dataframe, df_iris

In [3]:
df_iris = data("iris")

In [4]:
print("print the first 3 rows")
print(df_iris.head(3))

print the first 3 rows
   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

In [5]:
print("print the number of rows and columns (shape)")
print(df_iris.shape)

print the number of rows and columns (shape)
(150, 5)

In [6]:
print("print the column names")
print(*df_iris.columns, sep=" | ")

print the column names
Sepal.Length | Sepal.Width | Petal.Length | Petal.Width | Species

In [7]:
print("print the data type of each column")
print(df_iris.dtypes)

print the data type of each column
Sepal.Length    float64
Sepal.Width     float64
Petal.Length    float64
Petal.Width     float64
Species          object
dtype: object

In [8]:
print("print the summary statistics for each of the numeric variables. Would you recommend rescaling the data based on these statistics?")
print(df_iris.describe())

print the summary statistics for each of the numeric variables. Would you recommend rescaling the data based on these statistics?
       Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

I would not rescale because the each numeric variable is in centimeters and is close together.

## 2. Read the data tab from the stats module dataset, Excel_Stats.xlsx, into a dataframe, df_excel

In [9]:
df_excel = pd.read_excel("Excel_Stats.xlsx", sheet_name="Data")

* assign the first 100 rows to a new dataframe, df_excel_sample

In [10]:
df_excel_sample = df_excel.head(100)

In [11]:
print("print the number of rows of your original dataframe")
print(df_excel.shape[0])

print the number of rows of your original dataframe
7043

In [12]:
print("print the first 5 column names")
print(*df_excel.columns[:5], sep=", ")

print the first 5 column names
customer_id, gender, is_senior_citizen, partner, dependents

In [13]:
print("print the column names that have a data type of object")
print(*df_excel.select_dtypes(include="object").columns, sep=" | ")
df_excel.dtypes

print the column names that have a data type of object
customer_id | gender | partner | dependents | payment_type | churn

customer_id           object
gender                object
is_senior_citizen      int64
partner               object
dependents            object
tenure                 int64
phone_service          int64
internet_service       int64
contract_type          int64
payment_type          object
monthly_charges      float64
total_charges        float64
churn                 object
dtype: object

In [14]:
print("compute the range for each of the numeric variables.")
df_num_vars = df_excel.select_dtypes(include="number")
print(df_num_vars.apply(lambda s: s.max() - s.min()))

compute the range for each of the numeric variables.
is_senior_citizen       1.0
tenure                 72.0
phone_service           2.0
internet_service        2.0
contract_type           2.0
monthly_charges       100.5
total_charges        8666.0
dtype: float64

## 3. Read train.csv from google drive (shared through classroom in topic 'Classification') into a dataframe labeled df_google

In [15]:
# sheets_url = "https://docs.google.com/spreadsheets/d/1tSdauljeTt9CT5WdWULGRyWSPQT3ofn38sVIBlIc6zM/edit#gid=1473664817"
# sheets_url = sheets_url.replace('/edit#gid=', '/export?format=csv&gid=')
df_google = pd.read_csv("train.csv")

In [16]:
print("print the first 3 rows")
print(df_google.head(3))

print the first 3 rows
   rowid                 date  Temperature  Humidity  Light     CO2  \
0      1  2015-02-04 17:51:00        23.18   27.2720  426.0  721.25
1      2  2015-02-04 17:51:59        23.15   27.2675  429.5  714.00
2      3  2015-02-04 17:53:00        23.15   27.2450  426.0  713.50

   HumidityRatio  Occupancy
0       0.004793          1
1       0.004783          1
2       0.004779          1

In [17]:
print("print the number of rows and columns")
print(df_google.shape)

print the number of rows and columns
(8143, 8)

In [18]:
print("print the column names")
print(*df_google.columns, sep=" | ")

print the column names
rowid | date | Temperature | Humidity | Light | CO2 | HumidityRatio | Occupancy

In [19]:
print("print the data type of each column")
print(df_google.dtypes)

print the data type of each column
rowid              int64
date              object
Temperature      float64
Humidity         float64
Light            float64
CO2              float64
HumidityRatio    float64
Occupancy          int64
dtype: object

In [20]:
print("print the summary statistics for each of the numeric variables")
print(df_google.describe())

print the summary statistics for each of the numeric variables
             rowid  Temperature     Humidity        Light          CO2  \
count  8143.000000  8143.000000  8143.000000  8143.000000  8143.000000
mean   4072.000000    20.619084    25.731507   119.519375   606.546243
std    2350.825954     1.016916     5.531211   194.755805   314.320877
min       1.000000    19.000000    16.745000     0.000000   412.750000
25%    2036.500000    19.700000    20.200000     0.000000   439.000000
50%    4072.000000    20.390000    26.222500     0.000000   453.500000
75%    6107.500000    21.390000    30.533333   256.375000   638.833333
max    8143.000000    23.180000    39.117500  1546.333333  2028.500000

       HumidityRatio    Occupancy
count    8143.000000  8143.000000
mean        0.003863     0.212330
std         0.000852     0.408982
min         0.002674     0.000000
25%         0.003078     0.000000
50%         0.003801     0.000000
75%         0.004352     0.000000
max         0.006476     1.000000

In [21]:
# print("print the unique values for each of your categorical variables")
# SKIP per Zach; there are no categorical variables

## 4. In mysql workbench or a terminal, write a query to select all the columns of the passengers table from the titanic database. Export that table to a csv you store locally. Read that csv into a dataframe df_csv.

In [22]:
df_csv = pd.read_csv("titanic.csv")
df_csv.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1

In [23]:
print("print the number of rows and columns")
print(df_csv.shape)

print the number of rows and columns
(891, 13)

In [24]:
print("print the column names")
print(*df_csv.columns, sep=" | ")

print the column names
passenger_id | survived | pclass | sex | age | sibsp | parch | fare | embarked | class | deck | embark_town | alone

In [25]:
print("print the data type of each column")
print(df_csv.dtypes)

print the data type of each column
passenger_id      int64
survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class            object
deck             object
embark_town      object
alone             int64
dtype: object

In [26]:
print("print the summary statistics for each numeric variable")
print(df_csv[["age", "fare"]].describe())

print the summary statistics for each numeric variable
              age        fare
count  714.000000  891.000000
mean    29.699118   32.204208
std     14.526497   49.693429
min      0.420000    0.000000
25%     20.125000    7.910400
50%     28.000000   14.454200
75%     38.000000   31.000000
max     80.000000  512.329200

In [27]:
print("print the unique values for each categorical variables. If there are more than 5 distinct values, print the top 5 in terms of prevelence or frequency.")
cols = ("survived", "pclass", "sex", "sibsp", "parch", "embarked", "class", "deck", "alone")
for col in cols:
    print(f"{col:>10}: {', '.join(pd.Series(df_csv[col].value_counts().index.values).astype(str).unique()[:5])}")

print the unique values for each categorical variables. If there are more than 5 distinct values, print the top 5 in terms of prevelence or frequency.
  survived: 0, 1
    pclass: 3, 1, 2
       sex: male, female
     sibsp: 0, 1, 2, 4, 3
     parch: 0, 1, 2, 5, 3
  embarked: S, C, Q
     class: Third, First, Second
      deck: C, B, D, E, A
     alone: 1, 0